In [1]:
import pandas as pd

In [44]:
data={
    "A":[1,2,3,4],
    "B":[10,20,30,40],
    "C":[20,40,60,80]}
indices=["Row 1","Row 2","Row 3","Row 4"]

In [45]:
df=pd.DataFrame(data,index=indices)

In [46]:
df

       A   B   C
Row 1  1  10  20
Row 2  2  20  40
Row 3  3  30  60
Row 4  4  40  80

In [47]:
#add another columns called sum consisting of A+B+C
df["sum"]=df.sum(axis="columns") #use also axis=0

In [48]:
df

       A   B   C  sum
Row 1  1  10  20   31
Row 2  2  20  40   62
Row 3  3  30  60   93
Row 4  4  40  80  124

In [53]:
#add another row called total
df.loc["Row 5"]=df.sum(axis="rows")

In [54]:
df

        A    B    C  sum
Row 1   1   10   20   31
Row 2   2   20   40   62
Row 3   3   30   60   93
Row 4   4   40   80  124
Row 5  10  100  200  310